{
	"ExperienceItems": [
		{
			"Title": "Chief Technology Officer (CTO)",
			"Company": "La Clinique E-Santé",
			"Period": "2022 - Present, Paris, France",
			"Description": [
				"Strategic Leadership and Product Development: Directed the development and launch of mobile applications for iOS and Android, forming the main platform for e-consultations and patient management.",
				"Payment Systems and E-Consultation Features: Led the integration of Stripe to optimize payment flows, overseeing subscription management, invoicing, and payment systems.",
				"Event Sourcing and Domain-Driven Design: Created an event-sourcing framework in Golang with deep expertise in domain-driven programming. Managed the entire technology stack from end to end, including infrastructure, deployment, cloud management, and cost optimization.",
				"Agile Transformation and Corporate Culture: Established agile development cycles, improving efficiency and accountability within a 20-person team. Promoted a lean corporate culture focused on sprint planning, continuous improvement, and results-oriented project delivery.",
				"Enhancements to Patient and Therapist Platforms: Supervised the development of a patient dashboard, communication tools for therapists, health questionnaires, and a booking system with email notifications and therapist matching algorithms.",
				"Complete Platform Migration: Successfully migrated the entire platform from an unmaintainable custom PHP setup without source control to a robust Golang backend with a React frontend. This complex transition covered patient, psychologist, and back-office interfaces, maintaining full functionality for thousands of active users. The new system is more maintainable, secure, and has resolved previous user privacy issues."
			]
		},
		{
			"Title": "Staff Engineer - Payment Platform",
			"Company": "leboncoin",
			"Period": "2021 - 2022, Paris, France",
			"Description": [
				"Architectural Leadership in Payment Systems: Served as the principal architect and designer of the peer-to-peer (P2P) payment system utilized by leboncoin. Spearheaded the technical vision, ensuring scalability, security, and reliability, enhancing the overall payment infrastructure for the platform."
			]
		},
		{
			"Title": "Lead Developer",
			"Company": "leboncoin",
			"Period": "2019 - 2021, Paris, France",
			"Description": [
				"Cultural and Technical Alignment Across Teams: Aligned 100 backend developers across 20 teams, focusing on embedding company culture and values into the codebase. Established core backend principles—harmony, robustness, vivacity, and evolutivity—to ensure coherent and comprehensible code. Organized and led bi-weekly meetups for all backend developers, fostering open discussions, consensus-building, and strategic decision-making on coding practices."
			]
		},
		{
			"Title": "Backend Developer",
			"Company": "leboncoin",
			"Period": "2017 - 2019, Paris, France",
			"Description": [
				"Migration to a Distributed, Event-Driven Payment System: Successfully transitioned from a centralized payment history database with over 1.4 billion rows—previously accessed by 20 teams—to a robust, REST API-based, event-driven payment system. Designed to integrate multiple payment providers, including Adyen, Paybox, and Stripe. Utilized Kafka to update payment results across teams, improving scalability, reliability, and maintainability."
			]
		},
		{
			"Title": "Fullstack Developer",
			"Company": "Artefact",
			"Period": "2015 - 2017, Paris, France",
			"Description": [
				"Development of Real-Time Insights Platform for Marketing Strategy: Developed a data insights platform designed for marketing decision-makers, analyzing navigational data from major seller sites like Samsung. Applied machine learning algorithms such as K-means clustering to provide real-time insights into user behavior, enabling strategic decision-making for marketing teams."
			]
		},
		{
			"Title": "Home Cooking Service Entrepreneur",
			"Company": "Thuis aan Tafel - Netherlands",
			"Period": "2012 - 2015, Netherlands",
			"Description": [
				"Created and maintained a software solution using MS ACCESS",
				"Managed accounting and financial responsibility"
			]
		}
	]
}
